sample_app/app/controllers/password_resets_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kamil1@tester.com"], ["LIMIT", 1]]
---
  def create
    email_sent_msg = "An email has been sent with a link to reset the password"
    wrong_email_msg = "Email not found in database"
    @user = User.find_by(email: params[:password_reset][:email].downcase)

UPDATE "users" SET "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["updated_at", "2021-04-20 11:37:21.357554"], ["password_digest", "$2a$12$6YiIUbFYOKgdpEKylTDhcOpvR.jvdPjS03wzkB2RvDrxp9CXbr7Q6"], ["id", 102]]
---
  def update
    if params[:user][:password].empty?    # case 1 - empty password (looks successful but isn't)
      @user.errors.add(:password, "Password can't be empty")
      render "edit"
    elsif @user.update(user_params)       # case 2 - successful password change

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "kamil@tester.com"], ["LIMIT", 1]]
---
  def get_user
    @user = User.find_by(email: params[:email])