sample_app/app/controllers/users_controller.rb

  def index
    @users = User.where(activated: !nil).paginate(page: params[:page])
---
SELECT "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]

  def show_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def update
    #@user = User.find(params[:id])
    if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "updated_at" = ?, "password_digest" = ? WHERE "users"."id" = ?  [["email", "walczykah@gmail.com"], ["updated_at", "2021-04-03 10:06:45.518605"], ["password_digest", "$2a$12$YMMwFp4WaOXEbvHpahDPOuw8r9dAbWGwx/1/TbjSvJdNJfa3xC93i"], ["id", 2]]